// 3) Შექმენით მასივი რომელშიც შეინახავთ ყველა 0-დან --- 50-მდე ყველა 2 ის ჯერად
// ან 5 ის ჯერად რიცხვებს მაგრამ არავითარ შემთხვევაში ერთდროულად 2-ის და 5 -
// ის ჯერად რიცხვებს.
let arr = [];
for (let i = 0; i <= 50; i++) {
  if ((i % 2 === 0 || i % 5 === 0) && !(i % 2 === 0 && i % 5 === 0)) {
    arr.push(i);
  }
}
console.log(arr);




// let arr = [];
// for (var i = 0; i <= 50; i++) {
//   if (i % 2 == 0 && i % 5 == 0) {
//     continue;
//   } else if (i % 2 == 0 || i % 5 == 0) {
//     arr.push(i);
//   }
// }
// console.log(arr);